Repository: BenCos17/ben-cogs
Catalog: skysearch/locales/*.po
Languages: ga_ie

source: SkySearch - Aircraft tracking and information cog.
ga_ie: SkySearch - Crog rianaithe agus eolais ar aerárthaí.

source: SkySearch command group
ga_ie: Grúpa ordaithe SkySearch

source: Thanks for using SkySearch
ga_ie: Go raibh maith agat as SkySearch a úsáid

source: SkySearch is a powerful, easy-to-use OSINT tool for tracking aircraft.
ga_ie: Is uirlis OSINT chumhachtach, éasca le húsáid é SkySearch chun aerárthaí a rianú.

source: Use `aircraft` to show available commands to fetch information about live aircraft and configure emergency squawk alerts.
ga_ie: Úsáid `aircraft` chun orduithe atá ar fáil a thaispeáint chun eolas faoi aerárthaí beo a fháil agus foláirimh squawk éigeandála a chumrú.

source: Use `airport` to show available commands to fetch information and imagery of airports around the world.
ga_ie: Úsáid `airport` chun orduithe atá ar fáil a thaispeáint chun eolas agus íomhánna d'aerfoirt ar fud an domhain a fháil.

source: Use `skysearch apistats` to view API performance and usage statistics
ga_ie: Úsáid `skysearch apistats` chun feidhmíocht agus staitisticí úsáide API a fheiceáil

source: Get SkySearch statistics.
ga_ie: Faigh staitisticí SkySearch.

source: SkySearch Statistics
ga_ie: Staitisticí SkySearch

source: Consolidated statistics and data sources for SkySearch.
ga_ie: Staitisticí comhdhlúite agus foinsí sonraí do SkySearch.

source: This data appears in the following commands
ga_ie: Tá na sonraí seo le feiceáil sna horduithe seo a leanas

source: Law enforcement aircraft
ga_ie: Aerárthaí forfheidhmithe dlí

source: Military & government aircraft
ga_ie: Aerárthaí míleata agus rialtais

source: Medical aircraft
ga_ie: Aerárthaí leighis

source: Media aircraft
ga_ie: Aerárthaí meán

source: Damaged aircraft
ga_ie: Aerárthaí damáistithe

source: Wartime aircraft
ga_ie: Aerárthaí cogaidh

source: Utility aircraft
ga_ie: Aerárthaí fóntais

source: Balloons
ga_ie: Balúin

source: Suspicious aircraft
ga_ie: Aerárthaí amhrasacha

source: Other services
ga_ie: Seirbhísí eile

source: Additional data used in this cog is shown below
ga_ie: Sonraí breise a úsáidtear sa chrog seo thíos

source: Photography
ga_ie: Grianghrafadóireacht

source: Photos are powered by community contributions at [planespotters.net](https://www.planespotters.net/)
ga_ie: Cumhachtaítear na grianghraif le ranníocaíochtaí pobail ag [planespotters.net](https://www.planespotters.net/)

source: Airport data
ga_ie: Sonraí aerfoirt

source: Airport data is powered by the [airport-data.com](https://airport-data.com/) API service
ga_ie: Cumhachtaítear sonraí aerfoirt ag seirbhís API [airport-data.com](https://airport-data.com/)

source: Runway data
ga_ie: Sonraí ráillí

source: Runway data is powered by the [airportdb.io](https://airportdb.io) API service
ga_ie: Cumhachtaítear sonraí ráillí ag seirbhís API [airportdb.io](https://airportdb.io)

source: Mapping and imagery
ga_ie: Léarscáiliú agus íomhánna

source: Mapping and ground imagery powered by [Google Maps](https://maps.google.com) and the [Maps Static API](https://developers.google.com/maps/documentation/maps-static)
ga_ie: Cumhachtaítear léarscáiliú agus íomhánna talún ag [Google Maps](https://maps.google.com) agus an [Maps Static API](https://developers.google.com/maps/documentation/maps-static)

source: Get detailed API request statistics (delegates to AdminCommands).
ga_ie: Faigh staitisticí mionsonraithe iarratais API (ionadaíonn do AdminCommands).

source: Reset API request statistics (delegates to AdminCommands).
ga_ie: Athshocraigh staitisticí iarratais API (úinéir amháin).

source: Manually save API statistics to config (delegates to AdminCommands).
ga_ie: Sábháil staitisticí API de láimh sa chumraíocht (úinéir amháin).

source: View API statistics saving configuration (delegates to AdminCommands).
ga_ie: Féach ar chumraíocht sábhála staitisticí API (úinéir amháin).

source: Command center for aircraft related commands and API monitoring
ga_ie: Lárionad orduithe le haghaidh orduithe aerárthaí agus monatóireacht API

source: Aircraft Commands
ga_ie: Orduithe Aerárthaí

source: Available aircraft-related commands and API monitoring:
ga_ie: Orduithe aerárthaí atá ar fáil agus monatóireacht API:

source: Search Commands
ga_ie: Orduithe Cuardaigh

source: Special Aircraft
ga_ie: Aerárthaí Speisialta

source: Export
ga_ie: Easpórtáil

source: `export` - Export aircraft data to CSV, PDF, TXT, or HTML
ga_ie: `export` - Easpórtáil sonraí aerárthaí go CSV, PDF, TXT, nó HTML

source: Configuration
ga_ie: Cumraíocht

source: Other
ga_ie: Eile

source: `scroll` - Scroll through available planes
ga_ie: `scroll` - Scaoll trí eitleáin atá ar fáil

source: Debug
ga_ie: Dífhabhtú

source: `debugapi` - Debug API issues (owner only) `debugtoggle` - Toggle debug output for lookups (owner only) `debug` - Run a debug lookup (owner only)
ga_ie: `debugapi` - Ceisteanna API a dhífhabhtú (úinéir amháin) `debugtoggle` - Scoránaigh aschur dífhabhtaithe do chuardaigh (úinéir amháin) `debug` - Rith cuardach dífhabhtaithe (úinéir amháin)

source: Detailed Help
ga_ie: Cabhair Mhionsonraithe

source: Use `*help aircraft` for detailed command information
ga_ie: Úsáid `*help aircraft` le haghaidh faisnéise ordaithe mionsonraithe

source: Get aircraft information by ICAO hex code.
ga_ie: Faigh faisnéis aerárthaigh de réir cód heics ICAO.

source: Get aircraft information by callsign.
ga_ie: Faigh faisnéis aerárthaigh de réir comhartha glao.

source: Get aircraft information by registration.
ga_ie: Faigh faisnéis aerárthaigh de réir chláraithe.

source: Get aircraft information by type.
ga_ie: Faigh faisnéis aerárthaigh de réir cineáil.

source: Get aircraft information by squawk code.
ga_ie: Faigh faisnéis aerárthaigh de réir cód squawk.

source: Export aircraft data to various formats.
ga_ie: Easpórtáil sonraí aerárthaí go formáidí éagsúla.

source: Get information about military aircraft.
ga_ie: Faigh eolas faoi aerárthaí míleata.

source: Get information on LADD-restricted aircraft.
ga_ie: Faigh eolas ar aerárthaí faoi shrianta LADD.

source: View live aircraft using private ICAO addresses.
ga_ie: Féach ar aerárthaí beo ag úsáid seoltaí ICAO príobháideacha.

source: Get information about aircraft within a specified radius.
ga_ie: Faigh eolas faoi aerárthaí laistigh de gha sonraithe.

source: Find the closest aircraft to specified coordinates.
ga_ie: Aimsigh an t-aerárthach is gaire do na comhordanáidí sonraithe.

source: Scroll through available planes. Optionally specify a category: mil, ladd, pia, or all.
ga_ie: Scaoll trí na heitleáin atá ar fáil. Is féidir catagóir a shonrú: mil, ladd, pia, nó all.

source: Set or clear a channel to send emergency squawk alerts to.
ga_ie: Socraigh nó glan cainéal chun foláirimh squawk éigeandála a sheoladh chuige.

source: Set or clear a role to mention when new emergency squawks occur.
ga_ie: Socraigh nó glan ról le lua nuair a tharlaíonn squawk éigeandála nua.

source: Set or show the cooldown for emergency squawk alerts. Default cooldown is 5 minutes. Use without a value to check current setting. Accepts minutes (e.g. 5, 5m) or seconds (e.g. 30s) Examples: [p]aircraft alertcooldown 10m - Set cooldown to 10 minutes [p]aircraft alertcooldown 30s - Set cooldown to 30 seconds [p]aircraft alertcooldown - Show current cooldown
ga_ie: Socraigh nó taispeáin an sos fuaraithe do fhógraí squawk éigeandála. Réamhshocrú: 5 nóiméad. Úsáid gan luach chun an socrú reatha a fheiceáil. Glacann nóiméid (m.sh. 5, 5m) nó soicind (m.sh. 30s). Samplaí: [p]aircraft alertcooldown 10m - Socraigh go 10 nóiméad [p]aircraft alertcooldown 30s - Socraigh go 30 soicind [p]aircraft alertcooldown - Taispeáin an sos reatha

source: Enable or disable automatic ICAO lookup.
ga_ie: Cumasaigh nó díchumasaigh cuardach ICAO uathoibríoch.

source: Enable or disable automatic deletion of 'not found' messages.
ga_ie: Cumasaigh nó díchumasaigh scriosadh uathoibríoch teachtaireachtaí 'gan aimsiú'.

source: Show alert task status and output if set.
ga_ie: Taispeáin stádas na tascanna foláirimh agus aschur más socraithe.

source: Debug API key and connection issues (DM only).
ga_ie: Dífhabhtaigh eochair API agus saincheisteanna ceangail (DM amháin).

source: Set which API to use globally: 'primary' or 'fallback'. (owner only)
ga_ie: Socraigh cén API le húsáid go domhanda: 'primary' nó 'fallback'. (úinéir amháin)

source: Show the current global API mode. (owner only)
ga_ie: Taispeáin an mód API domhanda reatha. (úinéir amháin)

source: Debug an aircraft lookup: *aircraft debug <lookup_type> <value> (lookup_type: icao, callsign, reg, type, squawk)
ga_ie: Dífhabhtaigh cuardach aerárthaigh: *aircraft debug <lookup_type> <value> (lookup_type: icao, callsign, reg, type, squawk)

source: Enable or disable aircraft debug output: *aircraft debugtoggle <on|off>
ga_ie: Cumasaigh nó díchumasaigh aschur dífhabhtaithe aerárthaigh: *aircraft debugtoggle <on|off>

source: Set the airplanes.live API key.
ga_ie: Socraigh eochair API airplanes.live.

source: Show the current airplanes.live API key (partially masked).
ga_ie: Taispeáin eochair API airplanes.live reatha (páirt-cheilte).

source: Clear the airplanes.live API key.
ga_ie: Glan eochair API airplanes.live.

source: Command center for airport related commands
ga_ie: Lárionad orduithe le haghaidh orduithe aerfoirt

source: Get airport information by ICAO or IATA code.
ga_ie: Faigh eolas aerfoirt de réir cód ICAO nó IATA.

source: Get runway information for an airport.
ga_ie: Faigh eolas rúidbhealaigh d'aerfort.

source: Get navigational aids for an airport.
ga_ie: Faigh cabhracha loingseoireachta d'aerfort.

source: Get the weather for an airport by ICAO or IATA code (US airports only).
ga_ie: Faigh an aimsir d'aerfort de réir cód ICAO nó IATA (aerfoirt SAM amháin).

source: Set the OpenWeatherMap API key.
ga_ie: Socraigh eochair API OpenWeatherMap.

source: Show the current OpenWeatherMap API key (partially masked).
ga_ie: Taispeáin eochair API OpenWeatherMap reatha (páirt-cheilte).

source: Clear the OpenWeatherMap API key.
ga_ie: Glan eochair API OpenWeatherMap.

source: Aircraft landed
ga_ie: Aerárthach tuirlingthe

source: Aircraft {hex} has landed while squawking {squawk}.
ga_ie: Tá aerárthach {hex} tuirlingthe agus é ag squawkáil {squawk}.

source: Simulate a new emergency alert for testing callbacks (owner only). Usage: *aircraft simulateemergency <hex_code> [squawk_code] [callsign] Examples: - *aircraft simulateemergency ABC123 - *aircraft simulateemergency DEF456 7600 UNITED789
ga_ie: Insamhail foláireamh éigeandála nua chun glaonna ar ais a thástáil (úinéir amháin). Úsáid: *aircraft simulateemergency <hex_code> [squawk_code] [callsign] Samplaí: - *aircraft simulateemergency ABC123 - *aircraft simulateemergency DEF456 7600 UNITED789

source: ❌ Invalid squawk code. Valid codes are: {codes}
ga_ie: ❌ Cód squawk neamhbhailí. Is iad na cóid bhailí: {codes}

source: ❌ Invalid hex code. Must be 6 hexadecimal characters (e.g., ABC123)
ga_ie: ❌ Cód heics neamhbhailí. Ní mór 6 charachtar heicsidheachúlach a bheith ann (m.sh., ABC123)

source: 🧪 Simulating emergency alert: {hex} squawking {squawk}...
ga_ie: 🧪 Ag insamhail foláireamh éigeandála: {hex} ag squawkáil {squawk}...

source: ❌ No alert channel configured. Use `*aircraft alertchannel #channel` first.
ga_ie: ❌ Níl aon chainéal foláirimh cumraithe. Úsáid `*aircraft alertchannel #channel` ar dtús.

source: ❌ Alert channel {channel_id} not found
ga_ie: ❌ Cainéal foláirimh {channel_id} gan aimsiú

source: ✅ Simulated emergency alert sent! Check #{channel} and console logs.
ga_ie: ✅ Foláireamh éigeandála insamhlaithe seolta! Seiceáil #{channel} agus logaí consóil.

source: Clear all alert cooldowns for this guild (owner only).
ga_ie: Glan gach sos fuaraithe foláirimh don ghild seo (úinéir amháin).

source: ✅ All alert cooldowns cleared for this guild.
ga_ie: ✅ Gach sos fuaraithe foláirimh glanta don ghild seo.

source: Alert channel set to {channel}
ga_ie: Cainéal foláirimh socraithe go {channel}

source: Alert channel cleared. No more alerts will be sent.
ga_ie: Cainéal foláirimh glanta. Ní sheolfar a thuilleadh foláirimh.

source: Alert role set to {role}
ga_ie: Ról foláirimh socraithe go {role}

source: Alert role cleared. No more role mentions will be made.
ga_ie: Ról foláirimh glanta. Ní dhéanfar a thuilleadh lua ról.

source: Cooldown must be a positive number.
ga_ie: Ní mór uimhir dheimhneach a bheith sa sos fuaraithe.

source: Emergency alert cooldown set to {seconds} seconds.
ga_ie: Sos fuaraithe foláirimh éigeandála socraithe go {seconds} soicind.

source: Emergency alert cooldown set to {minutes} minutes.
ga_ie: Sos fuaraithe foláirimh éigeandála socraithe go {minutes} nóiméad.

source: Invalid duration format. Use a number (e.g. '5'), minutes ('5m'), or seconds ('30s')
ga_ie: Formáid fad neamhbhailí. Úsáid uimhir (m.sh. '5'), nóiméid ('5m'), nó soicind ('30s')

source: Current emergency alert cooldown is {seconds} seconds.
ga_ie: Is é {seconds} soicind an sos fuaraithe foláirimh éigeandála reatha.

source: Current emergency alert cooldown is {minutes} minutes.
ga_ie: Is é {minutes} nóiméad an sos fuaraithe foláirimh éigeandála reatha.

source: Auto Settings Status
ga_ie: Stádas Socrú Uathoibríoch

source: ICAO Lookup
ga_ie: Cuardach ICAO

source: ✅ **Enabled** - Automatic ICAO lookup is active
ga_ie: ✅ **Cumasaithe** - Tá cuardach ICAO uathoibríoch gníomhach

source: 📊 Airplanes.live API Statistics
ga_ie: 📊 Staitisticí API Airplanes.live

source: Detailed request tracking and performance metrics
ga_ie: Rianú mionsonraithe iarratais agus méadracht feidhmíochta

source: 📈 Overall Stats
ga_ie: 📈 Staitisticí Foriomlána

source: **Total Requests:** {total:,} **Success Rate:** {rate:.1f}% **Last Request:** {last}
ga_ie: **Iarratais Iomlána:** {total:,} **Ráta Ratha:** {rate:.1f}% **Iarratas Deireanach:** {last}

source: Never
ga_ie: Riamh

source: ✅ Success/Failure
ga_ie: ✅ Rath/Teip

source: **Successful:** {success:,} **Failed:** {failed:,} **Rate Limited:** {rate_limited:,}
ga_ie: **Rathúil:** {success:,} **Teip:** {failed:,} **Teoranta Ráta:** {rate_limited:,}

source: 🌐 API Mode Usage
ga_ie: 🌐 Úsáid Mód API

source: **Primary:** {primary:,} **Fallback:** {fallback:,}
ga_ie: **Bunscoile:** {primary:,} **Cúlphlean:** {fallback:,}

source: ⚡ Performance
ga_ie: ⚡ Feidhmíocht

source: **Avg Response:** {avg:.3f}s **Last 24h:** {requests:,} requests
ga_ie: **Freagairt Meán:** {avg:.3f}s **24u anuas:** {requests:,} iarratais

source: 🔗 Top Endpoints
ga_ie: 🔗 Pointe Deiridh Barr

source: ⚠️ Error Details
ga_ie: ⚠️ Mionsonraí Earráide

source: Use 'skysearch apistats_reset' to reset statistics | 'skysearch apistats_save' to manually save.
ga_ie: Úsáid 'skysearch apistats_reset' chun staitisticí a athshocraigh | 'skysearch apistats_save' chun sábháil de láimh.

source: ⚙️ API Statistics Save Configuration
ga_ie: ⚙️ Cumraíocht Sábhála Staitisticí API

source: Current configuration for automatic saving of API statistics
ga_ie: Cumraíocht reatha le haghaidh sábhála uathoibríoch staitisticí API

source: 📊 Batch Saving
ga_ie: 📊 Sábháil Baisc

source: **Batch Size:** {batch_size} requests **Current Count:** {current_count} requests
ga_ie: **Méid Baisc:** {batch_size} iarratais **Comhaireamh Reatha:** {current_count} iarratais

source: ⏰ Time-Based Saving
ga_ie: ⏰ Sábháil Bunaithe ar Am

source: **Interval:** {interval} seconds **Time Since Last Save:** {time_since:.1f} seconds
ga_ie: **Idirbhealach:** {interval} soicind **Am ón Sábháil Deireanach:** {time_since:.1f} soicind

source: 🔄 Save Strategy
ga_ie: 🔄 Straitéis Sábhála

source: **Hybrid Approach:** Save when either: • Batch size is reached (10 requests) • Time interval is reached (30 seconds) • Whichever comes first
ga_ie: **Cur Chuige Hibrideach:** Sábháil nuair a bhíonn ceachtar: • Méid baisc bainte amach (10 iarratais) • Idirbhealach ama bainte amach (30 soicind) • Cibé a thagann ar dtús

source: This prevents config spam while ensuring data persistence
ga_ie: Coscann sé seo spam cumraíochta agus cinntíonn sé leanúnachas sonraí
